package uz.alvasti.lotinkirill;

import uz.alvasti.lotinkirill.texttranslator.TextTranslator;
import uz.alvasti.lotinkirill.wordtranslator.Word;
import uz.alvasti.lotinkirill.wordtranslator.WordTranslator;
import uz.alvasti.lotinkirill.wordtranslator.WordsLibrary;

import java.io.BufferedReader;
import java.io.File;
import java.io.FileReader;
import java.io.PrintWriter;
import java.nio.charset.StandardCharsets;

public class Example {

    public static void main(String[] args) {


//        String testUpper = "ЪАаБбДsdsdsъwewewe123''';3[12 6 sentyabr ";
//        System.out.println(testUpper.toUpperCase());

        TextTranslator textTranslator = new TextTranslator();

        var ss = "Вилоятларда реаниматологларнинг маоши кескин пасайиб кетди. Муаммо нимада?\n" +
                "Молия вазирлигининг 2023 йил январдаги кўрсатма хати билан анестезиолог-реаниматологларнинг маоши 20 фоизгача қисқарган. Гап шундаки, уларга ҳақ тўлаш коэффициенти энг юқори ҳақ тўланадиган 4-гуруҳдан 2-гуруҳга ўтказилган. Айрим туманлар реанимация бўлими ходимлари судга даъво аризасини киритган. Қарийб 6 ойдан бери мурожаат қилмаган жойи қолмаган шифокорлар Kun.uz’га тафсилотларни сўзлаб берди.Ўтган ойда кузатилган ўқитувчиларнинг таътил пуллари камайиши билан боғлиқ муаммо ортидан энди шифокорлар ҳам маоши қисқарганидан шикоят қилмоқда.\n" +
                "\n" +
                "Республика вилоятларида туман ва шаҳарлардаги шифохоналарнинг анестезиологик реаниматологоя бўлимлари врачларининг маошлари 20 фоизгача қисқариб кетган. Бу муаммо Тошкент шаҳри ва Тошкент вилоятидан бошқа ҳудудлардаги шифохоналарда кузатилмоқда. Kun.uz таҳририятга келиб тушган мурожаатлар асосида вазиятни ўрганди.\n" +
                "\n" +
                "Шу пайтгача шаҳар ва туман марказларидаги шошилинч тиббий бўлимлари ходимларига иш ҳақи Вазирлар Маҳкамасининг 2005 йилдаги 276-сонли қарори асосида тўланарди.\n" +
                "\n" +
                "Унда соғлиқни сақлаш муассасалари гуруҳлари бўйича маошлар 4 коэффициент асосида белгиланган; шошилинч тиббий бўлимлар ходимлари 4-гуруҳга кирган. Яъни бунда ходимларга белгиланган маош гуруҳларга қараб қуйидаги коэффициентга кўпайтирилган:\n" +
                "\n" +
                "Муассасаларнинг 1-гуруҳи учун — тегишли разряд тариф ставкасига 1,0 тузатиш коэффициенти;\n" +
                "Муассасаларнинг 2-гуруҳи учун — тегишли разряд тариф ставкасига 1,03 тузатиш коэффициенти;\n" +
                "Муассасаларнинг 3-гуруҳи учун — тегишли разряд тариф ставкасига 1,05 тузатиш коэффициенти;\n" +
                "Муассасаларнинг 4-гуруҳи учун — тегишли разряд тариф ставкасига 1,15 тузатиш коэффициенти қўлланган.\n" +
                "Юқоридаги гуруҳларга белгиланган коэффициентлар асосида реаниматологларга бошқа гуруҳларга кирувчилардан кўра кўпроқ маош тўланарди.\n" +
                "\n" +
                "Аммо 2023 йил бошидан реанимация бўлимлари ходимларининг ойлиги иш юкламаси камаймаган ҳолда пасайиб кетди. Буни Kun.uz’га Андижон ва Бухоро вилоятларидаги туман шифохоналарида реанимация бўлимида ишлайдиган врачлар тасдиқлади. Таҳририят шифокорлар илтимосига биноан, уларнинг исм-фамилияси ва ишлайдиган жойи номини сир сақлайди.\n" +
                "\n" +
                "«Биласизми, шошилинч бўлим шифокорларининг иши осон эмас, биз қачон авария содир бўлади ёки фалокат туфайли оғир аҳволдаги бемор келтирилади, билмаймиз. Баъзан суткалаб тик оёқда шошилинч ишлашга тўғри келади.\n" +
                "\n" +
                "2005 йилдаги қарор асосида шу каби сабабларга кўра туман ва шаҳарларнинг шошилинч тиббий ёрдам ва уларнинг таркибидаги реанимация бўлимлари шифокорлари ойликлари коэффициент бўйича энг юқори даражага олиб чиқилган. Аммо 2023 йил бошидан ҳаммаси ўзгарди, ойликларимиз бирданига 20 фоизгача қисқариб кетди. Бунга Молия вазирлигининг биргина хати сабаб бўлди», дейди Kun.uz билан суҳбатлашган шифокорлардан бири.\n" +
                "\n" +
                "Маълум бўлишича, Молия вазирлигининг 2023 йил 25 январдаги 05/28-33/26-сонли кўрсатма хати (ҳужжат таҳририятда бор) талабларида марказий туман (шаҳар) шифохоналарининг шошилинч тиббий ёрдам бўлимларидаги ўринлари педиатрия, терапия ва хирургия бўлимлари таркибига ўтказилган. Бундан ташқари, улар таркибидаги реанимация бўлимлари марказий шифохона таркибига ўтказилиб, ундаги тиббиёт ходимлари меҳнатига ҳақ тўлаш режали шифо ўринлари ходимларининг меҳнатига ҳақ тўлаш шартлари бўйича амалга ошириладиган бўлди.\n" +
                "\n" +
                "Гап шундаки, Молия вазирлиги кўрсатма хати билан энг юқори коэффициентга кўра маош тўланадиган реанимация бўлимлари шифокорлари 4-гуруҳдан 2-гуруҳга тушди. Гуруҳларнинг ўзгариши уларнинг маоши 10 фоизгача пасайишига олиб келди.\n" +
                "\n" +
                "«Иш юкламамиз камайган бўлса ҳам рози бўлардик. Аммо иш юкламаси ошган бўлса ошдики, камаймади. Ўзи 6 нафар беморга қарашимиз керак, аммо ҳозир 8 беморга қараяпмиз. Норматив бўйича битта ҳамшира 2 беморга қараши керак, лекин ҳозир 3 ҳамширага 8 бемор тўғри келяпти.\n" +
                "\n" +
                "Яна орада операцияга ҳам кириб чиқиши керак. Баъзида беморлар сони кунига 9-10 нафарга етади. Туман шароитида кўпинча йиқилиб ҳушини йўқотганларни олиб келишади. Реанимацион ҳолатда кўп касал келади. Битта бизнинг туманда эмас, ҳамма туманларда аҳвол шундай. Бўлимда иш 24 соат давом этади», дейди яна бир анестезиолог-реаниматолог врач.\n" +
                "\n" +
                "Реанимация бўлимлари шифокорларининг ойлик маошини ҳисоблаш 4-гуруҳдан 2-гуруҳга тушгач, уларнинг иш стажи бўйича тўланадиган устамалар ҳам камайиб кетди. Шу вақтгача 3 йил узлуксиз меҳнат стажига эга бўлган реаниматологларга – 10 фоиз, 5 йилга – 20 фоиз, 7 йил ва ундан кўп ишлаганларга 30 фоиз устама тўланган. Шунда реаниматологларга тўланадиган устаманинг энг кўп миқдори 30 фоиз эди. 2-гуруҳда эса устамаларнинг энг юқори миқдори 20 фоиз.\n" +
                "\n" +
                "Шундай қилиб, 7 йил ва ундан ошиқ ишлаб маошига 30 фоиз устама олиб келган реаниматологларга 30 фоиз эмас, 20 фоиз устама тўлана бошланди. Шу билан, уларнинг маоши жами 20 фоиздан ортиққа камайиб кетди.\n" +
                "\n" +
                "35 йилдан бери реаниматолог бўлиб ишлайдиган андижонлик шифокор Kun.uz билан суҳбатда Молия вазирлигининг хатоси билан соҳада энг узоқ ишлаганлар кўпроқ зарар кўрганини айтади.\n" +
                "\n" +
                "«Мурожаат қилмаган жойимиз қолмади. Ана тузатилади, мана тўғриланади деб 6 ой вақт ўтиб кетди. Бюджет харажатлари нега шифокорларнинг маошини қисқартириш эвазига қопланиши керак?» – дейди у.\n" +
                "\n" +
                "Маълум бўлишича, 2023 йил феврал ойида Соғлиқни сақлаш вазирлиги бу муаммони ҳал қилиш учун буйруқ чиқарган. Аммо буйруқ Адлия вазирлиги билан келишилмагани учун юридик кучга эга эмас деб топилган. Натижада Молия вазирлигининг кўрсатма хати асосида 6 ойдан бери реаниматологлар паст маош олиб келяпти.\n" +
                "\n" +
                "Kun.uz билан суҳбатлашган бошқа шифокорларнинг айтишича, Молия вазирлигининг 2023 йил 25 январдаги буйруғи чиққунга қадар, улар январ ойи учун олдинги тартибда ойлик олишган. «Биздан январ ойида «ортиқча» тўлаб юборилган маблағни қайтариб беришни талаб қилишяпти. Бу қанақаси? Буйруқ 25 январда   чиққан бўлса?» – дейди у.\n" +
                "\n" +
                "Иқтисодчи Отабек Бакировнинг ёзишича, бундай хатоликлар юз берган тақдирда бюджет ходимлари маошларининг камайтирилмаслиги белгилаб қўйилган.\n" +
                "\n" +
                "«Молия вазирлиги, ССВ, Меҳнат ва ижтимоий ҳимоя вазирлиги 27.01.2006 йилда биргаликда тасдиқлаган қўлланмаси ҳам мавжуд. Унга кўра, меҳнатга ҳақ тўлашнинг янги қоидалари агар маошлар камайишига олиб келса, эски иш ҳақлари ўзгартирилмай сақланиб қолиниши лозимлиги кўрсатилган. Лекин ўзбек чиновниклари ўзлари ёзган қоидаларга ўзлари амал қилармиди?» – дея савол қўяди у.\n" +
                "\n" +
                "Таҳририятга маълум бўлишича, Марҳамат тумани тиббиёт бирлашмаси анестезиология ва реанимация бўлими мудири Ў.Имомов ва 9 нафар тиббиёт ходимлари  бузилган ҳуқуқларини тиклаш учун Асака туманлараро фуқаролик судига даъво аризасини киритган (Ариза нусхаси таҳририятда мавжуд).\n" +
                "\n" +
                "Аризада суддан Марҳамат туман молия бўлими ва Марҳамат туман тиббиёт бирлашмасига туман марказий шифохонасининг реанимация бўлими мудири Ў.Имомов ва бошқа 9 нафар тиббиёт ходимларига меҳнатга ҳақ тўланишини Ўзбекистон Республикаси Вазирлар Маҳкамасининг 2005 йил 21 декабрдаги 276-сонли қарорининг 1-илова 4-гуруҳи муассасалари (7073-бўлим 102-кичик бўлим 54-боб) бўйича тўлаш мажбуриятини юклаш тўғрисида қарор чиқаришни сўралган. Ҳозирда иш судда кўриляпти.\n" +
                "\n" +
                "Бундан ташқари, даъвогарлар 2022 йил декабр ойидан 2023 йил май ойигача бўлган даврдаги иш ҳақларини қайта ҳисоб-китоб қилиб тўлаш мажбурияти юкланишини талаб қилмоқда.\n" +
                "\n" +
                "Kun.uz ҳолат юзасидан Иқтисодиёт ва молия вазирлиги ҳамда Соғлиқни сақлаш вазирлигига сўров юборди. Масъул ташкилотларнинг жавоби кутилмоқда.";
        var ss1 = "salom-palom-a'lo yo'qligimda";
        var ss2 = "ettirmoq";//yoʻqligimda

        char c = 699;

        System.out.println(c);

//        for (int i = 0; i < 10; i++) {
//            ss = textTranslator.translateToLatin(
//                    ss
//            );
//        }
        System.out.println(
                textTranslator.translateAuto(
                        ss
                )
        );

        System.out.println(
                textTranslator.translateAuto(
                        ss1
                )
        );

        System.out.println(
                textTranslator.translateAuto(
                        ss2
                )
        );


        System.out.println(((char)(700)));

//        Э 1069
//        э 1101

//        var arr = WordsLibrary.wordsInitial;
//        for (String[] ar : arr) {
//            for (String[] ar1 : arr) {
//                //                {'ъ', 'Ъ', '-', 'ь', 'Ь'}
//                if (ar[0].equalsIgnoreCase(ar1[0] + "ь")) {
//                    System.out.println(ar1[0]);
//                    break;
//                }
//            }
//        }

//        String s1 = new String("asd");
//        System.out.println("asd".hashCode());
//        System.out.println(s1.hashCode());
//        for (int i = 0; i < ss.length(); i++) {
//            int o = ss.charAt(i);
//            System.out.print(ss.charAt(i) + " " + o + "  ");
//        }
//        System.out.println();

//        System.out.println(
//                textTranslator.translateAuto(
//                        "декабрь масъул масъулиятлиликларининг"
//                )
//        );
//        int k = '’', l = 'ʼ', j = '’';
//        char cc = 699;
//        System.out.println("’ʼ");
//        System.out.println(k);
//        System.out.println(l);
//        System.out.println(j);
//        System.out.println(cc);


//        System.out.println(
//                textTranslator.translateAuto(
//                        "Екатиринбур"
//                )
//        );

//        String text = "sentabr";//"хаvоrаnggаzbo`lib   E'LON ASS"+((char)(700))+"SD ";//""E'LON E'lon e'lon emma'as";
//        String text1 = "аъзамжондэк эЪлон 6 центябр ўъжаз АДЪЮНКТ СЪЁМ ";

//        textTranslator.translateAuto("СЪЁМ");
//        System.out.println(textTranslator.translateAuto(text));
//        System.out.println();
//        System.out.println(textTranslator.translateAuto(text1));

    }

    public static void testing() {
        File in = new File("testin.txt");

        File out = new File("testout.txt");

        WordTranslator wordTranslator = new WordTranslator();

        try (BufferedReader br = new BufferedReader(new FileReader(in));
             PrintWriter writer = new PrintWriter(out, StandardCharsets.UTF_8)) {

            StringBuilder sb = new StringBuilder();
            String line = br.readLine();

            while (line != null) {
                sb.append(line);
                sb.append(System.lineSeparator());
                line = br.readLine();
            }
            for (String s : sb.toString().split(("\\r?\\n"))) {
                for (String s1 : s.split(",")) {
                    Word word = new Word(s1);
                    writer.print(wordTranslator.translate(word) + "\n");
                }
            }


        } catch (Exception e) {
            e.printStackTrace();
        }
    }

}
